#### Terraform Format 🖌 `success`
#### Terraform Init ⚙️ `success`
#### Terraform Validate 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.external.existing_anomaly_monitors[0]: Reading...
module.dynamodb_billing_enforcer[0].data.archive_file.enforcer_lambda: Reading...
module.dynamodb_billing_enforcer[0].data.archive_file.enforcer_lambda: Read complete after 0s [id=f376f1c2968b21f6d2558489c4bd7d1a58c683a3]
module.service_quotas.aws_servicequotas_template.ec2_spot_vcpus["us-east-1"]: Refreshing state... [id=us-east-1,L-34B43A08,ec2]
module.service_quotas.aws_servicequotas_template.eks_clusters["us-east-1"]: Refreshing state... [id=us-east-1,L-1194D53C,eks]
module.service_quotas.aws_servicequotas_template.ec2_on_demand_vcpus["us-west-2"]: Refreshing state... [id=us-west-2,L-1216C47A,ec2]
module.service_quotas.aws_servicequotas_template_association.sandbox[0]: Refreshing state... [id=955063685555]
module.service_quotas.aws_servicequotas_template.ec2_on_demand_vcpus["us-east-1"]: Refreshing state... [id=us-east-1,L-1216C47A,ec2]
module.service_quotas.aws_servicequotas_template.eks_clusters["us-west-2"]: Refreshing state... [id=us-west-2,L-1194D53C,eks]
module.service_quotas.aws_servicequotas_template.ec2_spot_vcpus["us-west-2"]: Refreshing state... [id=us-west-2,L-34B43A08,ec2]
module.service_quotas.aws_servicequotas_template.lambda_concurrent_executions["us-west-2"]: Refreshing state... [id=us-west-2,L-B99A9384,lambda]
module.service_quotas.aws_servicequotas_template.lambda_concurrent_executions["us-east-1"]: Refreshing state... [id=us-east-1,L-B99A9384,lambda]
module.dynamodb_billing_enforcer[0].aws_iam_role.enforcer_lambda: Refreshing state... [id=ndx-dynamodb-billing-enforcer]
data.aws_organizations_organizational_unit_descendant_accounts.sandbox_pool[0]: Reading...
module.cost_anomaly_detection[0].data.aws_caller_identity.current: Reading...
module.scp_manager.aws_organizations_policy.cost_avoidance_compute[0]: Refreshing state... [id=p-1rzl0ufv]
module.scp_manager.aws_organizations_policy.nuke_supported_services: Refreshing state... [id=p-7pd0szg9]
module.scp_manager.aws_organizations_policy.restrictions: Refreshing state... [id=p-6tw8eixp]
module.scp_manager.aws_organizations_policy.cost_avoidance_services[0]: Refreshing state... [id=p-64setrzn]
module.cost_anomaly_detection[0].aws_sns_topic.cost_anomaly_alerts[0]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts]
module.budgets[0].aws_sns_topic.budget_alerts[0]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts]
module.cost_anomaly_detection[0].data.aws_caller_identity.current: Read complete after 0s [id=955063685555]
module.budgets[0].aws_iam_role.budget_actions[0]: Refreshing state... [id=ndx-sandbox-budget-actions]
module.dynamodb_billing_enforcer[0].aws_cloudwatch_event_rule.dynamodb_table_changes: Refreshing state... [id=ndx-dynamodb-billing-enforcer]
module.cost_anomaly_detection[0].aws_sns_topic_policy.cost_anomaly_alerts[0]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts]
data.aws_organizations_organizational_unit_descendant_accounts.sandbox_pool[0]: Read complete after 0s [id=ou-2laj-sre4rnjs]
module.cost_anomaly_detection[0].aws_sns_topic_subscription.email[1]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts:9d1f7fcc-5914-45ee-88c5-0e7e9da7f6e0]
module.cost_anomaly_detection[0].aws_sns_topic_subscription.email[2]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts:6aa4a142-c55b-4842-b027-33445a05fa86]
module.cost_anomaly_detection[0].aws_sns_topic_subscription.email[0]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts:c292863b-a7ea-48bc-8d25-295fde17c607]
module.budgets[0].aws_sns_topic_policy.budget_alerts[0]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts]
module.scp_manager.aws_organizations_policy_attachment.cost_avoidance_compute[0]: Refreshing state... [id=ou-2laj-sre4rnjs:p-1rzl0ufv]
module.scp_manager.aws_organizations_policy_attachment.nuke_supported_services: Refreshing state... [id=ou-2laj-4dyae1oa:p-7pd0szg9]
module.scp_manager.aws_organizations_policy_attachment.restrictions: Refreshing state... [id=ou-2laj-4dyae1oa:p-6tw8eixp]
module.scp_manager.aws_organizations_policy_attachment.cost_avoidance_services[0]: Refreshing state... [id=ou-2laj-sre4rnjs:p-64setrzn]
module.dynamodb_billing_enforcer[0].aws_lambda_function.enforcer: Refreshing state... [id=ndx-dynamodb-billing-enforcer]
module.dynamodb_billing_enforcer[0].aws_iam_role_policy.enforcer_lambda: Refreshing state... [id=ndx-dynamodb-billing-enforcer:ndx-dynamodb-billing-enforcer-policy]
module.budgets[0].aws_budgets_budget.service["bedrock"]: Refreshing state... [id=955063685555:ndx-sandbox-bedrock-daily]
module.budgets[0].aws_budgets_budget.service["apigateway"]: Refreshing state... [id=955063685555:ndx-sandbox-apigateway-daily]
module.budgets[0].aws_budgets_budget.service["rds"]: Refreshing state... [id=955063685555:ndx-sandbox-rds-daily]
module.budgets[0].aws_budgets_budget.service["data_transfer"]: Refreshing state... [id=955063685555:ndx-sandbox-data-transfer-daily]
module.budgets[0].aws_budgets_budget.service["stepfunctions"]: Refreshing state... [id=955063685555:ndx-sandbox-stepfunctions-daily]
module.budgets[0].aws_budgets_budget.service["dynamodb"]: Refreshing state... [id=955063685555:ndx-sandbox-dynamodb-daily]
module.budgets[0].aws_budgets_budget.service["lambda"]: Refreshing state... [id=955063685555:ndx-sandbox-lambda-daily]
module.budgets[0].aws_budgets_budget.service["s3"]: Refreshing state... [id=955063685555:ndx-sandbox-s3-daily]
module.budgets[0].aws_budgets_budget.service["ec2"]: Refreshing state... [id=955063685555:ndx-sandbox-ec2-daily]
module.budgets[0].aws_budgets_budget.service["cloudwatch"]: Refreshing state... [id=955063685555:ndx-sandbox-cloudwatch-daily]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["404584456509"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-404584456509]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["417845783913"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-417845783913]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["417845783913"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-417845783913]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["404584456509"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-404584456509]
module.budgets[0].aws_iam_role_policy.budget_actions[0]: Refreshing state... [id=ndx-sandbox-budget-actions:ndx-sandbox-budget-actions-policy]
module.dynamodb_billing_enforcer[0].aws_cloudwatch_log_group.enforcer_lambda: Refreshing state... [id=/aws/lambda/ndx-dynamodb-billing-enforcer]
module.dynamodb_billing_enforcer[0].aws_cloudwatch_event_target.invoke_enforcer_lambda: Refreshing state... [id=ndx-dynamodb-billing-enforcer-InvokeEnforcerLambda]
module.dynamodb_billing_enforcer[0].aws_lambda_permission.allow_eventbridge: Refreshing state... [id=AllowExecutionFromEventBridge]
data.external.existing_anomaly_monitors[0]: Read complete after 3s [id=-]
module.cost_anomaly_detection[0].aws_ce_anomaly_subscription.main[0]: Refreshing state... [id=arn:aws:ce::955063685555:anomalysubscription/f40ea33f-a96b-46a9-af5b-90b43dfeb134]
module.cost_anomaly_detection[0].aws_ce_anomaly_subscription.high_priority[0]: Refreshing state... [id=arn:aws:ce::955063685555:anomalysubscription/96ecf898-9412-42a3-9e3a-7043e88977a4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.budgets[0].aws_budgets_budget.daily_cost_per_account["404584456509"] will be destroyed
  # (because key ["404584456509"] is not in for_each map)
  - resource "aws_budgets_budget" "daily_cost_per_account" {
      - account_id        = "955063685555" -> null
      - arn               = "arn:aws:budgets::955063685555:budget/ndx-sandbox-daily-404584456509" -> null
      - budget_type       = "COST" -> null
      - id                = "955063685555:ndx-sandbox-daily-404584456509" -> null
      - limit_amount      = "50.0" -> null
      - limit_unit        = "USD" -> null
      - name              = "ndx-sandbox-daily-404584456509" -> null
      - tags              = {
          - "Component"        = "Budget-Guardrails"
          - "SandboxAccountId" = "404584456509"
        } -> null
      - tags_all          = {
          - "Component"        = "Budget-Guardrails"
          - "Environment"      = "production"
          - "ManagedBy"        = "Terraform"
          - "Project"          = "NDX"
          - "Repository"       = "terraform-scp-overrides"
          - "SandboxAccountId" = "404584456509"
        } -> null
      - time_period_end   = "2087-06-15_00:00" -> null
      - time_period_start = "2026-01-15_00:00" -> null
      - time_unit         = "DAILY" -> null

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "404584456509",
            ] -> null
        }

      - cost_types {
          - include_credit             = false -> null
          - include_discount           = true -> null
          - include_other_subscription = true -> null
          - include_recurring          = true -> null
          - include_refund             = false -> null
          - include_subscription       = true -> null
          - include_support            = true -> null
          - include_tax                = true -> null
          - include_upfront            = true -> null
          - use_amortized              = false -> null
          - use_blended                = false -> null
        }

      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 100 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 10 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 50 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
    }

  # module.budgets[0].aws_budgets_budget.daily_cost_per_account["417845783913"] will be destroyed
  # (because key ["417845783913"] is not in for_each map)
  - resource "aws_budgets_budget" "daily_cost_per_account" {
      - account_id        = "955063685555" -> null
      - arn               = "arn:aws:budgets::955063685555:budget/ndx-sandbox-daily-417845783913" -> null
      - budget_type       = "COST" -> null
      - id                = "955063685555:ndx-sandbox-daily-417845783913" -> null
      - limit_amount      = "50.0" -> null
      - limit_unit        = "USD" -> null
      - name              = "ndx-sandbox-daily-417845783913" -> null
      - tags              = {
          - "Component"        = "Budget-Guardrails"
          - "SandboxAccountId" = "417845783913"
        } -> null
      - tags_all          = {
          - "Component"        = "Budget-Guardrails"
          - "Environment"      = "production"
          - "ManagedBy"        = "Terraform"
          - "Project"          = "NDX"
          - "Repository"       = "terraform-scp-overrides"
          - "SandboxAccountId" = "417845783913"
        } -> null
      - time_period_end   = "2087-06-15_00:00" -> null
      - time_period_start = "2026-01-15_00:00" -> null
      - time_unit         = "DAILY" -> null

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "417845783913",
            ] -> null
        }

      - cost_types {
          - include_credit             = false -> null
          - include_discount           = true -> null
          - include_other_subscription = true -> null
          - include_recurring          = true -> null
          - include_refund             = false -> null
          - include_subscription       = true -> null
          - include_support            = true -> null
          - include_tax                = true -> null
          - include_upfront            = true -> null
          - use_amortized              = false -> null
          - use_blended                = false -> null
        }

      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 100 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 10 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 50 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
    }

  # module.budgets[0].aws_budgets_budget.monthly_cost_per_account["404584456509"] will be destroyed
  # (because key ["404584456509"] is not in for_each map)
  - resource "aws_budgets_budget" "monthly_cost_per_account" {
      - account_id        = "955063685555" -> null
      - arn               = "arn:aws:budgets::955063685555:budget/ndx-sandbox-monthly-404584456509" -> null
      - budget_type       = "COST" -> null
      - id                = "955063685555:ndx-sandbox-monthly-404584456509" -> null
      - limit_amount      = "1000.0" -> null
      - limit_unit        = "USD" -> null
      - name              = "ndx-sandbox-monthly-404584456509" -> null
      - tags              = {
          - "Component"        = "Budget-Guardrails"
          - "SandboxAccountId" = "404584456509"
        } -> null
      - tags_all          = {
          - "Component"        = "Budget-Guardrails"
          - "Environment"      = "production"
          - "ManagedBy"        = "Terraform"
          - "Project"          = "NDX"
          - "Repository"       = "terraform-scp-overrides"
          - "SandboxAccountId" = "404584456509"
        } -> null
      - time_period_end   = "2087-06-15_00:00" -> null
      - time_period_start = "2026-01-01_00:00" -> null
      - time_unit         = "MONTHLY" -> null

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "404584456509",
            ] -> null
        }

      - cost_types {
          - include_credit             = false -> null
          - include_discount           = true -> null
          - include_other_subscription = true -> null
          - include_recurring          = true -> null
          - include_refund             = false -> null
          - include_subscription       = true -> null
          - include_support            = true -> null
          - include_tax                = true -> null
          - include_upfront            = true -> null
          - use_amortized              = false -> null
          - use_blended                = false -> null
        }

      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 100 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 85 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "FORECASTED" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 100 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
    }

  # module.budgets[0].aws_budgets_budget.monthly_cost_per_account["417845783913"] will be destroyed
  # (because key ["417845783913"] is not in for_each map)
  - resource "aws_budgets_budget" "monthly_cost_per_account" {
      - account_id        = "955063685555" -> null
      - arn               = "arn:aws:budgets::955063685555:budget/ndx-sandbox-monthly-417845783913" -> null
      - budget_type       = "COST" -> null
      - id                = "955063685555:ndx-sandbox-monthly-417845783913" -> null
      - limit_amount      = "1000.0" -> null
      - limit_unit        = "USD" -> null
      - name              = "ndx-sandbox-monthly-417845783913" -> null
      - tags              = {
          - "Component"        = "Budget-Guardrails"
          - "SandboxAccountId" = "417845783913"
        } -> null
      - tags_all          = {
          - "Component"        = "Budget-Guardrails"
          - "Environment"      = "production"
          - "ManagedBy"        = "Terraform"
          - "Project"          = "NDX"
          - "Repository"       = "terraform-scp-overrides"
          - "SandboxAccountId" = "417845783913"
        } -> null
      - time_period_end   = "2087-06-15_00:00" -> null
      - time_period_start = "2026-01-01_00:00" -> null
      - time_unit         = "MONTHLY" -> null

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "417845783913",
            ] -> null
        }

      - cost_types {
          - include_credit             = false -> null
          - include_discount           = true -> null
          - include_other_subscription = true -> null
          - include_recurring          = true -> null
          - include_refund             = false -> null
          - include_subscription       = true -> null
          - include_support            = true -> null
          - include_tax                = true -> null
          - include_upfront            = true -> null
          - use_amortized              = false -> null
          - use_blended                = false -> null
        }

      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 100 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 85 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "FORECASTED" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 100 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
    }

  # module.budgets[0].aws_budgets_budget.service["apigateway"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-apigateway-daily"
        name              = "ndx-sandbox-apigateway-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "417845783913",
              - "404584456509",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = []
        }

        # (4 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["bedrock"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-bedrock-daily"
        name              = "ndx-sandbox-bedrock-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "417845783913",
              - "404584456509",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = []
        }

        # (5 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["cloudwatch"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-cloudwatch-daily"
        name              = "ndx-sandbox-cloudwatch-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "417845783913",
              - "404584456509",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = []
        }

        # (5 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["data_transfer"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-data-transfer-daily"
        name              = "ndx-sandbox-data-transfer-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "417845783913",
              - "404584456509",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = []
        }

        # (4 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["dynamodb"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-dynamodb-daily"
        name              = "ndx-sandbox-dynamodb-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "417845783913",
              - "404584456509",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = []
        }

        # (4 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["ec2"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-ec2-daily"
        name              = "ndx-sandbox-ec2-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "417845783913",
              - "404584456509",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = []
        }

        # (4 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["lambda"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-lambda-daily"
        name              = "ndx-sandbox-lambda-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "417845783913",
              - "404584456509",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = []
        }

        # (4 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["rds"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-rds-daily"
        name              = "ndx-sandbox-rds-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "417845783913",
              - "404584456509",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = []
        }

        # (4 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["s3"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-s3-daily"
        name              = "ndx-sandbox-s3-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "417845783913",
              - "404584456509",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = []
        }

        # (4 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["stepfunctions"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-stepfunctions-daily"
        name              = "ndx-sandbox-stepfunctions-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "417845783913",
              - "404584456509",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = []
        }

        # (4 unchanged blocks hidden)
    }

  # module.cost_anomaly_detection[0].aws_sns_topic_subscription.email[0] will be created
  + resource "aws_sns_topic_subscription" "email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + region                          = "us-east-1"
      + topic_arn                       = "arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts"
    }

  # module.cost_anomaly_detection[0].aws_sns_topic_subscription.email[1] will be created
  + resource "aws_sns_topic_subscription" "email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "ndx@dsit.gov.uk"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + region                          = "us-east-1"
      + topic_arn                       = "arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts"
    }

  # module.cost_anomaly_detection[0].aws_sns_topic_subscription.email[2] will be created
  + resource "aws_sns_topic_subscription" "email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "ndx-xxxxx@gds.slack.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + region                          = "us-east-1"
      + topic_arn                       = "arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts"
    }

  # module.service_quotas.aws_servicequotas_template.ec2_on_demand_vcpus["us-east-1"] will be destroyed
  # (because aws_servicequotas_template.ec2_on_demand_vcpus is not in configuration)
  - resource "aws_servicequotas_template" "ec2_on_demand_vcpus" {
      - aws_region   = "us-east-1" -> null
      - global_quota = false -> null
      - id           = "us-east-1,L-1216C47A,ec2" -> null
      - quota_code   = "L-1216C47A" -> null
      - quota_name   = "Running On-Demand Standard (A, C, D, H, I, M, R, T, Z) instances" -> null
      - region       = "us-east-1" -> null
      - service_code = "ec2" -> null
      - service_name = "Amazon Elastic Compute Cloud (Amazon EC2)" -> null
      - unit         = "None" -> null
      - value        = 64 -> null
    }

  # module.service_quotas.aws_servicequotas_template.ec2_on_demand_vcpus["us-west-2"] will be destroyed
  # (because aws_servicequotas_template.ec2_on_demand_vcpus is not in configuration)
  - resource "aws_servicequotas_template" "ec2_on_demand_vcpus" {
      - aws_region   = "us-west-2" -> null
      - global_quota = false -> null
      - id           = "us-west-2,L-1216C47A,ec2" -> null
      - quota_code   = "L-1216C47A" -> null
      - quota_name   = "Running On-Demand Standard (A, C, D, H, I, M, R, T, Z) instances" -> null
      - region       = "us-west-2" -> null
      - service_code = "ec2" -> null
      - service_name = "Amazon Elastic Compute Cloud (Amazon EC2)" -> null
      - unit         = "None" -> null
      - value        = 64 -> null
    }

  # module.service_quotas.aws_servicequotas_template.ec2_spot_vcpus["us-east-1"] will be destroyed
  # (because aws_servicequotas_template.ec2_spot_vcpus is not in configuration)
  - resource "aws_servicequotas_template" "ec2_spot_vcpus" {
      - aws_region   = "us-east-1" -> null
      - global_quota = false -> null
      - id           = "us-east-1,L-34B43A08,ec2" -> null
      - quota_code   = "L-34B43A08" -> null
      - quota_name   = "All Standard (A, C, D, H, I, M, R, T, Z) Spot Instance Requests" -> null
      - region       = "us-east-1" -> null
      - service_code = "ec2" -> null
      - service_name = "Amazon Elastic Compute Cloud (Amazon EC2)" -> null
      - unit         = "None" -> null
      - value        = 64 -> null
    }

  # module.service_quotas.aws_servicequotas_template.ec2_spot_vcpus["us-west-2"] will be destroyed
  # (because aws_servicequotas_template.ec2_spot_vcpus is not in configuration)
  - resource "aws_servicequotas_template" "ec2_spot_vcpus" {
      - aws_region   = "us-west-2" -> null
      - global_quota = false -> null
      - id           = "us-west-2,L-34B43A08,ec2" -> null
      - quota_code   = "L-34B43A08" -> null
      - quota_name   = "All Standard (A, C, D, H, I, M, R, T, Z) Spot Instance Requests" -> null
      - region       = "us-west-2" -> null
      - service_code = "ec2" -> null
      - service_name = "Amazon Elastic Compute Cloud (Amazon EC2)" -> null
      - unit         = "None" -> null
      - value        = 64 -> null
    }

  # module.service_quotas.aws_servicequotas_template.eks_clusters["us-east-1"] will be destroyed
  # (because aws_servicequotas_template.eks_clusters is not in configuration)
  - resource "aws_servicequotas_template" "eks_clusters" {
      - aws_region   = "us-east-1" -> null
      - global_quota = false -> null
      - id           = "us-east-1,L-1194D53C,eks" -> null
      - quota_code   = "L-1194D53C" -> null
      - quota_name   = "Clusters" -> null
      - region       = "us-east-1" -> null
      - service_code = "eks" -> null
      - service_name = "Amazon Elastic Kubernetes Service (Amazon EKS)" -> null
      - unit         = "None" -> null
      - value        = 2 -> null
    }

  # module.service_quotas.aws_servicequotas_template.eks_clusters["us-west-2"] will be destroyed
  # (because aws_servicequotas_template.eks_clusters is not in configuration)
  - resource "aws_servicequotas_template" "eks_clusters" {
      - aws_region   = "us-west-2" -> null
      - global_quota = false -> null
      - id           = "us-west-2,L-1194D53C,eks" -> null
      - quota_code   = "L-1194D53C" -> null
      - quota_name   = "Clusters" -> null
      - region       = "us-west-2" -> null
      - service_code = "eks" -> null
      - service_name = "Amazon Elastic Kubernetes Service (Amazon EKS)" -> null
      - unit         = "None" -> null
      - value        = 2 -> null
    }

  # module.service_quotas.aws_servicequotas_template.lambda_concurrent_executions["us-east-1"] will be destroyed
  # (because aws_servicequotas_template.lambda_concurrent_executions is not in configuration)
  - resource "aws_servicequotas_template" "lambda_concurrent_executions" {
      - aws_region   = "us-east-1" -> null
      - global_quota = false -> null
      - id           = "us-east-1,L-B99A9384,lambda" -> null
      - quota_code   = "L-B99A9384" -> null
      - quota_name   = "Concurrent executions" -> null
      - region       = "us-east-1" -> null
      - service_code = "lambda" -> null
      - service_name = "AWS Lambda" -> null
      - unit         = "Count" -> null
      - value        = 100 -> null
    }

  # module.service_quotas.aws_servicequotas_template.lambda_concurrent_executions["us-west-2"] will be destroyed
  # (because aws_servicequotas_template.lambda_concurrent_executions is not in configuration)
  - resource "aws_servicequotas_template" "lambda_concurrent_executions" {
      - aws_region   = "us-west-2" -> null
      - global_quota = false -> null
      - id           = "us-west-2,L-B99A9384,lambda" -> null
      - quota_code   = "L-B99A9384" -> null
      - quota_name   = "Concurrent executions" -> null
      - region       = "us-west-2" -> null
      - service_code = "lambda" -> null
      - service_name = "AWS Lambda" -> null
      - unit         = "Count" -> null
      - value        = 100 -> null
    }

  # module.service_quotas.aws_servicequotas_template_association.sandbox[0] will be destroyed
  # (because aws_servicequotas_template_association.sandbox is not in configuration)
  - resource "aws_servicequotas_template_association" "sandbox" {
      - id     = "955063685555" -> null
      - region = "us-east-1" -> null
      - status = "ASSOCIATED" -> null
    }

Plan: 3 to add, 10 to change, 13 to destroy.

Changes to Outputs:
  ~ budget_summary                    = {
      ~ accounts_discovered = 2 -> 0
        # (5 unchanged attributes hidden)
    }
  ~ discovered_sandbox_accounts       = {
      ~ account_ids = [
          - "417845783913",
          - "404584456509",
        ]
      ~ count       = 2 -> 0
    }
  - estimated_max_daily_cost          = "$81.60/day (estimated)" -> null
  ~ per_account_daily_budgets         = {
      - "404584456509" = "ndx-sandbox-daily-404584456509"
      - "417845783913" = "ndx-sandbox-daily-417845783913"
    }
  - service_quotas_summary            = {
      - cloudwatch = null
      - dynamodb   = null
      - ebs        = null
      - ec2        = {
          - gpu_vcpus       = 0
          - on_demand_vcpus = 64
          - p_vcpus         = 0
          - spot_vcpus      = 64
        }
      - eks        = {
          - cluster_count = 2
        }
      - elb        = null
      - lambda     = {
          - concurrent_executions = 100
        }
      - rds        = null
      - vpc        = null
    } -> null

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @chrisns, Action: `pull_request`*